package solid._1_singleResponsibility;

/**
 * <a href="https://nuancesprog.ru/p/18651/">Принципы SOLID</a>
 * <p>Принцип единственной ответственности</p>
 * Согласно этому принципу, класс должен меняться только по одной причине.
 * То есть у каждого модуля должно быть только одно назначение, отчего код становится удобнее
 * для восприятия и тестирования.
 * <p>
 * Задачи, связанные с управлением банковским счетом разделены на отдельные классы. Так, в случае необходимости
 * изменения, меняется только нужный класс.
 */
public class Main {
    public static void main(String[] args) {

    }
}
